In [1]:
print("Learning Python to Access Web Data")

Learning Python to Access Web Data

# converting dic into dataframe

In [11]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
      }

In [13]:
import pandas as pd
fr=pd.DataFrame(pop)
fr.head()

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

# setting index

In [14]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

In [15]:
army=pd.DataFrame(raw_data,columns=['regiment','company','deaths','battles',
                                   'size','veterans','readiness','armored',
                                   'deserters','origin'])
army.head(5)

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523,5,1045,1,1,1,4,Arizona
1,Nighthawks,1st,52,42,957,5,2,0,24,California
2,Nighthawks,2nd,25,2,1099,62,3,1,31,Texas
3,Nighthawks,2nd,616,2,1400,26,3,1,2,Florida
4,Dragoons,1st,43,4,1592,73,2,0,3,Maine

# Setting the index

In [16]:
army.set_index("origin",inplace=True)

# selection of diffrent columns and index

In [17]:
army.loc[['Maine','Alaska']][["deaths",'size','deserters']]

        deaths  size  deserters
origin
Maine       43  1592          3
Alaska     523   987         24

In [4]:
t=fr
t

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [6]:
t.loc[2003]=[4.5,6.5]

In [9]:
t[3]=[1,2,3,4]
t

      Nevada  Ohio  3
2000     NaN   1.5  1
2001     2.4   1.7  2
2002     2.9   3.6  3
2003     4.5   6.5  4

In [14]:
t.loc[4]=[45,99,88]
t

      Nevada  Ohio   3
2000     NaN   1.5   1
2001     2.4   1.7   2
2002     2.9   3.6   3
2003     4.5   6.5   4
4       45.0  99.0  88

In [21]:
import pandas as pd
fr=pd.DataFrame(pop)

In [22]:
t

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     4.5   6.5
4       45.0  99.0

In [23]:
pdata = {'Ohio': fr['Ohio'][:-1],
 'Nevada': fr['Nevada'][:2]}
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [24]:
fr

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [25]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [31]:
fr.index.name="year"
fr.columns.name="state"
fr.name="frame"
fr

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [32]:
t

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     4.5   6.5
4       45.0  99.0

In [35]:
t["Nevada"][2000]=4

In [36]:
t

      Nevada  Ohio
2000     4.0   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     4.5   6.5
4       45.0  99.0

In [38]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
 index=['a', 'c', 'd'],
 columns=['Ohio', 'Texas', 'California'])

In [39]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [63]:
l=['a','b','c','d']
frame.reindex(l)
p=["Ohio","Texas","California","Madagascar"]
frame.reindex(columns=p)
frame.loc['c']

Ohio          3
Texas         4
California    5
Name: c, dtype: int32

In [53]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

print(data[data["three"]>5])
print(data[data>5])

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
           one   two  three  four
Ohio       NaN   NaN    NaN   NaN
Colorado   NaN   NaN    6.0   7.0
Utah       8.0   9.0   10.0  11.0
New York  12.0  13.0   14.0  15.0

In [61]:
data.loc[["Utah","Ohio"],["one","three","two"]]

      one  three  two
Utah    8     10    9
Ohio    0      2    1

In [19]:

data.iloc[[1,2],[1,3]]

NameError: name 'data' is not defined

In [64]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
 columns=list('abcde'))

In [70]:
df1.loc[1]['b','c']=np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  NaN   NaN   7.0
2  8.0  9.0  10.0  11.0

In [71]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   6.0   7.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [76]:
a=1/df1

In [77]:
a.loc[0]['a']

inf

In [78]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [80]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
 index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.260953 -0.646738  1.294321
Ohio    0.189620  1.207002 -1.372489
Texas  -0.595028 -0.575157 -0.581435
Oregon  0.534599  0.043069  0.680355

In [81]:
np.abs(frame)

               b         d         e
Utah    1.260953  0.646738  1.294321
Ohio    0.189620  1.207002  1.372489
Texas   0.595028  0.575157  0.581435
Oregon  0.534599  0.043069  0.680355

In [82]:
f = lambda x: x.max() - x.min()

In [83]:
frame.apply(f)

b    1.855981
d    1.853740
e    2.666811
dtype: float64

In [86]:

1.260953+0.595028

1.8559809999999999

In [88]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4